#*******************************************************************************************
#	1.	CREACIÓN Y USO DE LA BASE DE DATOS 'CicloDAW'
#*******************************************************************************************

    
#*******************************************************************************************
#	2.	CREACIÓN DE LA TABLA DE LA BASE DE DATOS
#*******************************************************************************************
#		TABLA Modulo
#*******************************************************************************************
#		ID		int				auto_increment
#		Siglas	varchar(5)
#		Codigo	varchar(6)
#		Nombre	text
#		Horas	int
#
#		Llave primaria 					->	ID empieza desde el valor 100
#		Valor único    					->	Siglas, Codigo
#		Comprobación de Valor no nulo	->	Siglas, Codigo, Nombre, Horas
#		Comprobación de Valor no vacío	->	Siglas, Codigo, Nombre
#		Comprobación de Valor positivo	->	Horas
#		Índice							->	Horas
#*******************************************************************************************

    
#*******************************************************************************************
#	3.	AÑADIMOS LOS DATOS SIGLAS, CÓDIGO, NOMBRE Y HORAS DE CADA MÓDULO DENTRO DE UNA MISMA SENTENCIA
#*******************************************************************************************

        
#*******************************************************************************************
#	4.	CREAMOS 10 ALUMNOS Y 5 PROFESORES CON FORMATO Alumn_01, Alumn_02, ...Y Prof_1, Prof_2, ...
#*******************************************************************************************

    
#*******************************************************************************************
#	5.	CREAMOS DOS GRUPOS DE USUARIOS:	ALUMNADO, PROFESORADO
#		PROFESORADO -> ACCESO TOTAL
#		ALUMNADO	-> SÓLO CONSULTA
#*******************************************************************************************

    
#*******************************************************************************************
#	6.	DAMOS LOS RESPECTIVOS PRIVILEGIOS A LOS GRUPOS PROFESORADO Y ALUMNADO
#		PROFESORADO		Posibilidad de privilegios de acceso (role_admin) y creación de  usuarios (create user)
#		ALUMNADO		Sólo visibilidad (select)
#*******************************************************************************************

    
#*******************************************************************************************
#	7.	ASIGNAMOS A CADA GRUPO SUS USUARIOS CREADOS
#*******************************************************************************************

    
#*******************************************************************************************
#	8.	ASIGNAMOS PRIVILEGIOS POR DEFECTO
#*******************************************************************************************  


#*******************************************************************************************
#	9.	REFRESCAMOS LOS CAMBIOS YA REALIZADOS (AUNQUE NO ES NECESARIO)
#*******************************************************************************************

